dietolive-tw/ESP32-S3-CAM-MJPEG2SD/src/mjpeg2sd.cpp
void keepFrame(camera_fb_t* fb) {
  // keep required frame for external server alert
  if (fb->len < maxAlertBuffSize && alertBuffer != NULL) {
    memcpy(alertBuffer, fb->buf, fb->len);
    alertBufferSize = fb->len;
  } else if (fb->len >= maxAlertBuffSize) {
    // frame exceeds alert buffer - silently unusable for still sends, report once
    static uint32_t lastLog = 0;
    if (millis() - lastLog > 7000) {
      lastLog = millis();
      LOG_WRN("still frame too large: %u bytes > %u max - lower camera framesize", fb->len, maxAlertBuffSize);
    }
  }
}

static void saveFrame(camera_fb_t* fb) {
  // save frame on SD card
  uint32_t fTime = millis();
  // align end of jpeg on 4 byte boundary for AVI
  uint16_t filler = (4 - (fb->len & 0x00000003)) & 0x00000003;
  size_t jpegSize = fb->len + filler;
  // add avi frame header
  memcpy(iSDbuffer + highPoint, dcBuf, 4);
  memcpy(iSDbuffer + highPoint + 4, &jpegSize, 4);
  highPoint += CHUNK_HDR;
  if (highPoint >= RAMSIZE) {
    // marker overflows buffer
    highPoint -= RAMSIZE;
    aviFile.write(iSDbuffer, RAMSIZE);
    // push overflow to buffer start
    memcpy(iSDbuffer, iSDbuffer + RAMSIZE, highPoint);
  }
  // add frame content
  size_t jpegRemain = jpegSize;
  uint32_t wTime = millis();
  while (jpegRemain >= RAMSIZE - highPoint) {
    // write to SD when RAMSIZE is filled in buffer
    memcpy(iSDbuffer + highPoint, fb->buf + jpegSize - jpegRemain, RAMSIZE - highPoint);
    aviFile.write(iSDbuffer, RAMSIZE);
    jpegRemain -= RAMSIZE - highPoint;
    highPoint = 0;
  }
  wTime = millis() - wTime;
  wTimeTot += wTime;
  LOG_VRB("SD storage time %lu ms", wTime);
  // whats left or small frame
  memcpy(iSDbuffer + highPoint, fb->buf + jpegSize - jpegRemain, jpegRemain);
  highPoint += jpegRemain;

  buildAviIdx(jpegSize); // save avi index for frame
  vidSize += jpegSize + CHUNK_HDR;
  frameCnt++;
  fTime = millis() - fTime - wTime;
  fTimeTot += fTime;
  LOG_VRB("Frame processing time %lu ms", fTime);
  LOG_VRB("============================");
}

static bool closeAvi() {
  // closes the recorded file
  uint32_t vidDuration = millis() - startTime;
  uint32_t vidDurationSecs = lround(vidDuration / 1000.0);
  logLine();
  LOG_VRB("Capture time %lu, min seconds: %u ", vidDurationSecs, minSeconds);

  cTime = millis();
  // write remaining frame content to SD
  aviFile.write(iSDbuffer, highPoint);
  size_t readLen = 0;
  bool haveWav = false;
#if INCLUDE_AUDIO
  // add wav file if exists
  finishAudioRecord(true);
  haveWav = haveWavFile();
  if (haveWav) {
    do {
      readLen = writeWavFile(iSDbuffer, RAMSIZE);
      aviFile.write(iSDbuffer, readLen);
    } while (readLen > 0);
  }
#endif
  // save avi index
  finalizeAviIndex(frameCnt);
  do {
    readLen = writeAviIndex(iSDbuffer, RAMSIZE);
    if (readLen) aviFile.write(iSDbuffer, readLen);
  } while (readLen > 0);
  // save avi header at start of file
  float actualFPS = (1000.0f * (float)frameCnt) / ((float)vidDuration);
  uint8_t actualFPSint = (uint8_t)(lround(actualFPS));
  xSemaphoreTake(aviMutex, portMAX_DELAY);
  buildAviHdr(actualFPSint, fsizePtr, frameCnt);
  xSemaphoreGive(aviMutex);
  aviFile.seek(0, SeekSet); // start of file
  aviFile.write(aviHeader, AVI_HEADER_LEN);
  aviFile.close();
  LOG_VRB("Final SD storage time %lu ms", millis() - cTime);
  uint32_t hTime = millis();
#if INCLUDE_MQTT
  if (mqtt_active) {
    sprintf(jsonBuff, "{\"RECORD\":\"OFF\", \"TIME\":\"%s\"}", esp_log_system_timestamp());
    mqttPublish(jsonBuff);
    mqttPublishPath("record", "off");
  }
#endif
  if (vidDurationSecs >= minSeconds) {
    // name file to include actual dateTime, FPS, duration, and frame count
    int alen = snprintf(aviFileName, FILE_NAME_LEN - 1, "%s_%s_%u_%lu%s%s%s.%s",
                        partName, frameData[fsizePtr].frameSizeStr, actualFPSint, vidDurationSecs,
                        haveWav ? "_S" : "", haveSrt ? "_M" : "", dashCamOn ? "_C" : "", AVI_EXT);
    if (alen > FILE_NAME_LEN - 1) LOG_WRN("file name truncated");
    STORAGE.rename(AVITEMP, aviFileName);
    LOG_VRB("AVI close time %lu ms", millis() - hTime);
    cTime = millis() - cTime;
#if INCLUDE_TELEM
    stopTelemetry(aviFileName);
#endif
    if (dashCamOn) forceRecord = true; // restart continuous recording
    else {
      // AVI stats
      LOG_INF("******** AVI recording stats ********");
      LOG_ALT("Recorded %s", aviFileName);
      LOG_INF("AVI duration: %lu secs", vidDurationSecs);
      LOG_INF("Number of frames: %u", frameCnt);
      LOG_INF("Required FPS: %u", FPS);
      LOG_INF("Actual FPS: %0.1f", actualFPS);
      LOG_INF("File size: %s", fmtSize(vidSize));
      if (frameCnt) {
        LOG_INF("Average frame length: %lu bytes", vidSize / frameCnt);
        LOG_INF("Average frame monitoring time: %lu ms", dTimeTot / frameCnt);
        LOG_INF("Average frame buffering time: %lu ms", fTimeTot / frameCnt);
        LOG_INF("Average frame storage time: %lu ms", wTimeTot / frameCnt);
      }
      LOG_INF("Average SD write speed: %lu kB/s", ((vidSize / wTimeTot) * 1000) / 1024);
      LOG_INF("File open / completion times: %lu ms / %lu ms", oTime, cTime);
      LOG_INF("Busy: %lu%%", std::min(100 * (wTimeTot + fTimeTot + dTimeTot + oTime + cTime) / vidDuration, (uint32_t)100));
      checkMemory();
      LOG_INF("*************************************");
      // send out notification of motion if requested
#if INCLUDE_SMTP
      if (smtpUse) {
        // send email with movement image
        char subjectMsg[50];
        snprintf(subjectMsg, sizeof(subjectMsg) - 1, "from %s, in %s", hostName, aviFileName);
        emailAlert("Motion Alert", subjectMsg);
      } 
#endif
#if INCLUDE_TGRAM
      tgramAlert(aviFileName, "");
#endif
#if INCLUDE_FTP_HFS
      if (autoUpload) {
        if (deleteAfter) {
          // issue #380 - in case other files failed to transfer, do whole parent folder
          dateFormat(partName, sizeof(partName), true);
          fsStartTransfer(partName);
        } else fsStartTransfer(aviFileName); // transfer this file to remote ftp server
      }
#endif
    }
    if (!checkFreeStorage()) doRecording = forceRecord = false;
    return true;
  } else {
    // delete too small files if exist
    STORAGE.remove(AVITEMP);
    LOG_INF("Insufficient capture duration: %lu secs", vidDurationSecs);
    return false;
  }
}

static boolean processFrame() {
  // get camera frame
  static bool haveMotion = false;
  bool res = true;
  uint32_t dTime = millis();

  camera_fb_t* fb = esp_camera_fb_get();
  if (fb == NULL || !fb->len) return false;
  if (fb->len > maxFrameBuffSize) {
    // frame exceeds stream/alert buffers - report once per 7s
    static uint32_t lastLog = 0;
    if (millis() - lastLog > 7000) {
      lastLog = millis();
      LOG_WRN("frame too large: %u bytes > %u max - lower camera framesize", fb->len, maxFrameBuffSize);
    }
    return false;
  }
  timeLapse(fb);

  for (int i = 0; i < vidStreams; i++) {
    if (!streamBufferSize[i] && streamBuffer[i] != NULL) {
      memcpy(streamBuffer[i], fb->buf, fb->len);
      streamBufferSize[i] = fb->len;
      xSemaphoreGive(frameSemaphore[i]); // signal frame ready for stream
    }
  }
  if (doKeepFrame) {
    keepFrame(fb);
    doKeepFrame = false;
  }

  // determine if time to check for motion change
  int reasonId = 0;
  bool prevMotion = haveMotion;
  if (doMonitor(doRecording ? isCapturing : dbgMotion ? false : true)) {
    if (useMotion && checkMotion(fb, isCapturing)) reasonId = 1;
    if (!useMotion) checkMotion(fb, false, true); // calc light level only
#if INCLUDE_PERIPH
    // PIR directly triggers recording ONLY when visual motion detection is
    // disabled (useMotion=false). When useMotion is on, PIR only wakes the
    // camera (via pirGatePIRisr if pirGate enabled, or just passively);
    // recording requires visual motion confirmation.
    bool pirTriggered = pirUse && getPIRval();
    if (pirTriggered) {
      static uint32_t lastPirLog = 0;
      // log PIR detect at most once every 5s to avoid spam (RCWL-0516 hold time)
      if (millis() - lastPirLog > 5000) {
        LOG_INF("PIR detect");
        lastPirLog = millis();
      }
    }
    if (pirTriggered && !useMotion) reasonId = 2;
#endif
#if INCLUDE_I2C && USE_MPU
    if (accelUse && checkAccelMove()) reasonId = 3;
#endif
    haveMotion = (reasonId) ? true : false;
  }

#if INCLUDE_PERIPH
  // auto-track motion object if enabled; called every frame
  if (trackMotion) trackMotionObject();
#endif

